import React from "react";
import "/Users/ivanlucik/Documents/test/mycours/src/css/Advent.css"
import { FaPaperclip } from "react-icons/fa";

class Advent extends React.Component{
    constructor(props){
        super(props)

        this.state = {
            Ivents: [ 
                {
                    heder: "Тиждень 1: Вступ та основи створення біта",
                    data: "01.03.25",
                    ivent: "Дзвінок 0 (день 0): Вступний, знайомство, пояснення структури курсу."
                },
                {
                    data: "01.03.25 - 03.03.25",
                    ivent: " День 1-3: Основи Ableton Live",
                    element: ['Огляд інтерфейсу: Session View та Arrangement View.', 'Налаштування аудіо та MIDI.', 'Робота з бібліотекою звуків, навігація.','Гарячі клавіші для швидкої роботи.',],
                },
                {
                    data: "04.03.25 - 06.03.25",
                    ivent: " День 4-6: Теорія біта та створення першого біта",
                    element: ['Основи ритму та структура біта.','Розбір стилів: хаус, техно, трап, хіп-хоп.','Drum Rack та Simpler: робота з семплами.','Практика: створення першого простого біта.'],
                },
                {
                    heder: "Тиждень 2: Написання мелодії та драм-партії",
                    data: "07.03.25 ",
                    ivent: " Дзвінок 1 (день 7): Розбір помилок, Q&A, фідбек по бітах.",
                },
                {
                    data: "08.03.25 - 10.03.25",
                    ivent: " День 8-10: Мелодія в електронній музиці",
                    element: ['MIDI-кліпи та інструменти (Operator, Wavetable, Analog).','Використання плагінів та VST.','Мелодичні прийоми: арпеджіо, лупи, модуляція.','Практика: створення мелодії під біт.',],
                },
                {
                    data: "11.03.25 - 13.03.25",
                    ivent: " День 11-13: Написання драм-партії",
                    element: ['Додавання хетів, клепів, кіка, перкусії.','Робота з ефектами (Reverb, Delay, EQ).','Використання семплів і створення своїх звуків.','Автоматизація в драм-партіях.',],
                },
                {
                    heder: 'Тиждень 3: Теорія музики + завершення треку',
                    data: "14.03.25",
                    ivent: "День 14: Дзвінок 2 – Підсумки другого тижня",
                },
                {
                    data: "15.03.25 - 17.03.25",
                    ivent: "День 15-17: Основи гармонії та структури треку",
                    element: ['Тональність і ключ.','Основні акорди.','Структура треку: куплет, приспів, брейкдаун.',],
                },
                {
                    data: "18.03.25 - 19.03.25",
                    ivent: "День 18-19: Міксинг і мастеринг",
                    element: ['Основні принципи еквалізації.','Робота з компресією.','Використання реверберації та затримки.',],
                },
                {
                    data: "20.03.25",
                    ivent: "День 20: Завершення треку",
                    element: ['Автоматизація параметрів.','Останні штрихи.','Експорт готового треку.',],
                },
                {
                    data: "21.03.25",
                    ivent: "День 21: Фінальний дзвінок",
                    element: ['Презентація фінальних робіт.','Розбір помилок.','Підсумки та подальші кроки учасників.'],
                },      
            ],
        }
    }
    render(){
        console.log(this.state.Ivents)
        return(
            <div className="bodys">
                <div className="Ivent">
                <h1 className="Plans">План Курсу</h1>
                    {this.state.Ivents.map((el)=>(
                        <div className="Iventblock">
                            <div className="Data">
                                <p>{el.data}</p>
                            </div>
                            <div >
                                {el.heder && (<h3>{el.heder}</h3>)}
                                <h3>{el.ivent}</h3>  
                               
                                {el.element && (
                                    <ul className="Elements">
                                        <FaPaperclip className="paper-clip"/>
                                    <h4>Основні аспекти:</h4>
                                    {el.element.map((e)=>(
                                        <li>{e}</li>
                                    ))}
                                </ul>
                                )}
                            </div>
                        </div>
                    ))}
                </div>
            </div>         
        )
    }
}
export default Advent
