import React from "react";
import "/Users/ivanlucik/Documents/test/mycours/src/css/About.css"
class About extends React.Component{
    render(){

        
        return (
            <div className="About" >
                <div class="coursedescription">
                    <div className="hedbout">
                        <div className="baseabout">
                            <h1 className="hcus">Курс з музики:</h1>
                            <ul>
                                <p >
                                    Цей курс – ідеальний вибір для тих, хто мріє навчитися створювати музику з нуля та стати справжнім професіоналом у цій галузі. Ви отримаєте повний набір знань та практичних навичок: від базової теорії до написання власних композицій.
                                </p>
                                <p>
                                    Курс підходить для всіх, хто хоче навчитися створювати музику професійно, навіть без попереднього досвіду! 
                                </p>
                            </ul>
                        </div>
                    </div> 
                    <div className="hedbout">
                        <div className="secondabout">
                            <h1>Етапи навчання:</h1>
                            <ul>
                                <p> <strong>Теоретична база:</strong> відео-уроки та текстові матеріали допоможуть зрозуміти основи музики.</p>
                                <p> <strong>Практика в піано-ролі:</strong> навчитеся створювати барабанні партії та мелодії, експериментувати з аранжуваннями.</p>
                                <p> <strong>Тести та закріплення знань:</strong> для впевненого освоєння матеріалу.</p>
                            </ul>
                        </div>
                    </div>        
                    <div className="hedbout">
                        <div className="secondabout">
                            <h1>Чому варто обрати цей курс?</h1>
                            <ul>
                                <p>Викладач з 7-річним досвідом у музиці.</p>
                                <p>Великий асортимент власних бітів і готових композицій, створених у співпраці з відомими артистами.</p>
                                <p>1600 підписників на YouTube – це доказ довіри та якості контенту.</p>
                                <p>Послідовне навчання, яке допоможе вам стати професійним музичним продюсером.</p>
                            </ul>
                        </div>
                    </div>
                    
                </div>

            </div>
           
        )
    }
}
export default About